aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* クロック周波数微調整 */
    /*===================================================================*/
                            /*  +------------------------- 7 : -         */
                            /*  | +----------------------- 6 : -         */
                            /*  | | +--------------------- 5 : HFTUN5<5> */     /* 中央周波数 工場出荷設定 */
                            /*  | | | +------------------- 4 : HFTUN5<4> */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : HFTUN5<3> */
                            /*  | | | |     | +----------- 2 : HFTUN5<2> */
                            /*  | | | |     | | +--------- 1 : HFTUN5<1> */
                            /*  | | | |     | | | + ------ 0 : HFTUN5<0> */
    OSCTUNE =  0x00U;       /*  0 0 0 0  -  0 0 1 1                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 特に調整するつもりはないので初期設定                                 */
    /*===================================================================*/


    /* オシレータ手動動作許可 */ /* 周辺ユニットからの要求に応じて自動許可 */
    /*===================================================================*/
                            /*  +------------------------- 7 : EXTOEN    */
                            /*  | +----------------------- 6 : HFOEN     */
                            /*  | | +--------------------- 5 : MFOEN     */
                            /*  | | | +------------------- 4 : LFOEN     */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : SOSCEN    */
                            /*  | | | |     | +----------- 2 : ADOEN     */
                            /*  | | | |     | | +--------- 1 :           */
                            /*  | | | |     | | | + ------ 0 :           */
    OSCEN =  0x00U;         /*  0 0 0 0  -  0 0 1 1                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 特に調整するつもりはないので初期設定                                 */
    /*===================================================================*/

    /*=================================================================*/
                            /*  +------------------------- 7 : EN      */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 : DC<1>   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DC<0>   */
                            /*  | | | |     | +----------- 2 : DIV<2>  */
                            /*  | | | |     | | +--------- 1 : DIV<1>  */
                            /*  | | | |     | | | + ------ 0 : DIV<0>  */
    CLKRCON = 0x00U;        /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 外部へクロック出力はしないので初期値                               */
    /*=================================================================*/

    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 : CLK<2>  */
                            /*  | | | |     | | +--------- 1 : CLK<1>  */
                            /*  | | | |     | | | + ------ 0 : CLK<0>  */
    CLKRCLK = 0x00U;        /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 外部へクロック出力はしないので初期値                               */
    /*=================================================================*/
 
    
    /* クロック出力設定 */  /* デバッグ用に使う */

}


/**************************************************************/
/*  Function:                                                 */
/*  省電力処理関連の設定                                        */
/*                                                            */
/**************************************************************/
static void func_mset_s_pwr_save_setup( void )
{
    /* とりあえず今回のラジコンでは省電力周りは気にしないので全部初期値 */
    /* 周辺モジュールの有効/無効 切り替え関連 */
    PMD0 = 0x00U;
    PMD1 = 0x00U;
    PMD2 = 0x00U;
    PMD3 = 0x00U;
    PMD4 = 0x00U;
    PMD5 = 0x00U;

    /* リセット関連 */
    /*=================================================================*/
                            /*  +------------------------- 7 : SBOREN  */   /* 低電圧検出無効 */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 : BORRDY  */   /* RO */
    BORCON = 0x00U;         /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 外部へクロック出力はしないので初期値                               */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  割り込み初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_int_setup( void )
{
    /* 割り込み設定 */
    /*===================================================================*/
                            /*  +------------------------- 7 : GIE/GIEH  */   /* 高優先度割り込み：禁止 */
                            /*  | +----------------------- 6 : PEIE/GIEL */   /* 低優先度割り込み：禁止 */
                            /*  | | +--------------------- 5 : IPEN      */   /* 割り込み優先度機能：有効 2level */
                            /*  | | | +------------------- 4 :           */   /* 外部割込み 禁止 */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 :           */   /* 外部ピン変化割り込み 禁止 */
                            /*  | | | |     | +----------- 2 : INT2EDG   */   /* INT2ピン エッジ 立下り割り込み */
                            /*  | | | |     | | +--------- 1 : INT1EDG   */   /* INT1ピン エッジ 立下り割り込み */
                            /*  | | | |     | | | + ------ 0 : INT0EDG   */   /* INT0ピン エッジ 立下り割り込み */
    INTCON =  0x20U;        /*  0 0 1 #  -  # 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 初期化時点では全体割り込みは無効化しておく                            */
    /*===================================================================*/




