aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* ポート読み取り レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : RA7     */
                            /*  | +----------------------- 6 : RA6     */
                            /*  | | +--------------------- 5 : RA5     */
                            /*  | | | +------------------- 4 : RA4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RA3     */
                            /*  | | | |     | +----------- 2 : RA2     */
                            /*  | | | |     | | +--------- 1 : RA1     */
                            /*  | | | |     | | | + ------ 0 : RA0     */
    PORTA = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* ポート書き込み レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : LATA7   */
                            /*  | +----------------------- 6 : LATA6   */
                            /*  | | +--------------------- 5 : LATA5   */
                            /*  | | | +------------------- 4 : LATA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : LATA3   */
                            /*  | | | |     | +----------- 2 : LATA2   */
                            /*  | | | |     | | +--------- 1 : LATA1   */
                            /*  | | | |     | | | + ------ 0 : LATA0   */
    LATA = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    
    /* GPIO or アナログ入力選択 */
    /*=================================================================*/
                            /*  +------------------------- 7 : ANSELA7 */
                            /*  | +----------------------- 6 : ANSELA6 */
                            /*  | | +--------------------- 5 : ANSELA5 */
                            /*  | | | +------------------- 4 : ANSELA4 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ANSELA3 */
                            /*  | | | |     | +----------- 2 : ANSELA2 */
                            /*  | | | |     | | +--------- 1 : ANSELA1 */
                            /*  | | | |     | | | + ------ 0 : ANSELA0 */
    ANSELA = 0x00U;         /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:デジタル入出力                                                 */
    /* 1:アナログ入力                                                   */
    /*=================================================================*/

    /* 内部プルアップ設定(ただし弱い) レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : WPUA7   */
                            /*  | +----------------------- 6 : WPUA6   */
                            /*  | | +--------------------- 5 : WPUA5   */
                            /*  | | | +------------------- 4 : WPUA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : WPUA3   */
                            /*  | | | |     | +----------- 2 : WPUA2   */
                            /*  | | | |     | | +--------- 1 : WPUA1   */
                            /*  | | | |     | | | + ------ 0 : WPUA0   */
    WPUA = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：内部プルアップ無効                                             */
    /* 1：内部プルアップ有効                                             */
    /*=================================================================*/

    /* オープンドレイン制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : ODCA7   */
                            /*  | +----------------------- 6 : ODCA6   */
                            /*  | | +--------------------- 5 : ODCA5   */
                            /*  | | | +------------------- 4 : ODCA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ODCA3   */
                            /*  | | | |     | +----------- 2 : ODCA2   */
                            /*  | | | |     | | +--------- 1 : ODCA1   */
                            /*  | | | |     | | | + ------ 0 : ODCA0   */
    ODCONA = 0x00U;         /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：プッシュプル　シンク/ソース両方向                               */
    /* 1：オープンドレイン有効　シンク方向のみ                             */
    /*=================================================================*/

    /* ポートスルーレート制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    SLRCONA = 0x00U;        /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：スルーレート 最大　　                                          */
    /* 1：スルーレート 制限付き                                          */
    /*=================================================================*/

