aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=====================================================================================================================================================================*/


    /* ポート入出力方向設定 */
    /* TRISE は存在しない */

    /* ポート読み取り　レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RE3     */   /* MCLREで使用予定 リセット専用 */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : -       */
    PORTE = 0x00U;          /*  # # # #  -  0 # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* LATAC は存在しない */

    /* ANSELC は存在しない */

    /* 内部プルアップ設定(ただし弱い) レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : WPUE7   */
                            /*  | +----------------------- 6 : WPUE6   */
                            /*  | | +--------------------- 5 : WPUE5   */
                            /*  | | | +------------------- 4 : WPUE4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : WPUE3   */
                            /*  | | | |     | +----------- 2 : WPUE2   */
                            /*  | | | |     | | +--------- 1 : WPUE1   */
                            /*  | | | |     | | | + ------ 0 : WPUE0   */
    WPUE = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：内部プルアップ無効                                             */
    /* 1：内部プルアップ有効                                             */
    /*=================================================================*/

    /* ODCONE は存在しない */

    /* SLRCONC は存在しない */
    
    /* ポート入力バッファの種類 選択レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    INLVLE = 0x08U;         /*  # # # #  -  1 # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：入力読み取りは TTL バッファを使う                               */
    /* 1：入力読み取りは  ST バッファを使う                               */    /* こっちのほうがL->H遷移の閾値高いので安定 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  Intterrupt On Change 機能 初期設定                         */
/*                                                            */
/**************************************************************/
static void func_mset_s_ioc_setup( void )
{
    /* 実質割り込み設定なのだが、IOC機能用に分けて設けられている機能が亜多いので、別関数でまとめる */
    /* 今回ラジコンのパルス幅測定において、重点的に使う機能なので、細かめにメモ残しておく */

    /* ピン変化割り込みフラグ */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCAF7   */
                            /*  | +----------------------- 6 : IOCAF6   */
                            /*  | | +--------------------- 5 : IOCAF5   */
                            /*  | | | +------------------- 4 : IOCAF4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCAF3   */
                            /*  | | | |     | +----------- 2 : IOCAF2   */
                            /*  | | | |     | | +--------- 1 : IOCAF1   */
                            /*  | | | |     | | | + ------ 0 : IOCAF0   */
    IOCAF = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* H->L遷移、またはL->H遷移でフラグが立つ。IOCxPとIOCxNの設定に依存。    */
    /*==================================================================*/

    /* ピン変化割り込み H->L遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCAN7   */
                            /*  | +----------------------- 6 : IOCAN6   */
                            /*  | | +--------------------- 5 : IOCAN5   */
                            /*  | | | +------------------- 4 : IOCAN4   */  /* レブリミットレベル */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCAN3   */  /* シフトチェンジマニュアル入力 */
                            /*  | | | |     | +----------- 2 : IOCAN2   */  /* 加速量調節 */
                            /*  | | | |     | | +--------- 1 : IOCAN1   */  /* シフトチェンジモード */
                            /*  | | | |     | | | + ------ 0 : IOCAN0   */  /* 前進/後退 加速量 */
    IOCAN = 0x1FU;          /*  0 0 0 1  -  1 1 1 1                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */  /* パルス幅測定のために使用する */
    /* 0：H->L遷移で割り込み発生させない                                  */
    /* 1：H->L遷移で割り込み発生させる                                    */
    /*==================================================================*/

