aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : DAC1R4  */   /* 0/32 -> 0V設定  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DAC1R3  */
                            /*  | | | |     | +----------- 2 : DAC1R2  */
                            /*  | | | |     | | +--------- 1 : DAC1R1  */
                            /*  | | | |     | | | + ------ 0 : DAC1R0  */
    DAC1CON1 = 0x00U;       /*  0 0 0 0  -  0 0 0 0                   */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_pps_setup( void )
{ /* 改めてクソ高級マイコンだなと思う 全部のポートで割り当て変更可能・・・ */
    /* データシート補足 */
    /* xxxPPS：これは特定のレジスタを挿すわけではない */
    /* []PPSにおいて、ポート入力を選ぶ場合に、PORTA/B/Cのx番を登録したい際、どのように設定すればよいか、その設定例を示したもの。 */
    /* xxxPPSという１つのレジスタがあるわけではなく、以降の設定について説明しているだけ。 */

    /* PORT<1:0> ---- 00：PORTA / 01：PORTB / 10：PORTC */
    /* PIN<2:0>  ---- 2進数で0～7を指定する */

    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x00;             /* ロック解除：PPS機能選択を許可 */


    /* @@基本初期値 必要に応じて設定 */

    /* 出力割り当て設定 */
    /* PORTAの出力バッファの選択 */
    RA0PPS = 0x00U;             /* LATA0 を割り当て */
    RA1PPS = 0x00U;             /* LATA1 を割り当て */
    RA2PPS = 0x00U;             /* LATA2 を割り当て */
    RA3PPS = 0x00U;             /* LATA3 を割り当て */
    RA4PPS = 0x00U;             /* LATA4 を割り当て */
    RA5PPS = 0x00U;             /* LATA5 を割り当て */
    RA6PPS = 0x00U;             /* LATA6 を割り当て */
    RA7PPS = 0x00U;             /* LATA7 を割り当て */

    /* PORTBの出力バッファの選択 */
    RB0PPS = 0x00U;             /* LATB0 を割り当て */
    RB1PPS = 0x00U;             /* LATB1 を割り当て */
    RB2PPS = 0x00U;             /* LATB2 を割り当て */
    RB3PPS = 0x00U;             /* LATB3 を割り当て */
    RB4PPS = 0x00U;             /* LATB4 を割り当て */
    RB5PPS = 0x00U;             /* LATB5 を割り当て */
    RB6PPS = 0x00U;             /* LATB6 を割り当て */
    RB7PPS = 0x00U;             /* LATB7 を割り当て */

    /* PORTCの出力バッファの選択 */
    RC0PPS = 0x00U;             /* LATC0 を割り当て */
    RC1PPS = 0x00U;             /* LATC1 を割り当て */
    RC2PPS = 0x00U;             /* LATC2 を割り当て */
    RC3PPS = 0x00U;             /* LATC3 を割り当て */
    RC4PPS = 0x00U;             /* LATC4 を割り当て */
    RC5PPS = 0x00U;             /* LATC5 を割り当て */
    RC6PPS = 0x00U;             /* LATC6 を割り当て */
    RC7PPS = 0x00U;             /* LATC7 を割り当て */

    /* タイマ ゲート選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : PORT<1>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : PORT<0>    */
                            /*  | | | |     | +----------- 2 : PIN<2>     */
                            /*  | | | |     | | +--------- 1 : PIN<1>     */
                            /*  | | | |     | | | + ------ 0 : PIN<0>     */
    T1GPPS = 0x10U;         /*  # # # 1  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* タイマ1 ゲート選択：RC0                                              */
    /*====================================================================*/

    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : PORT<1>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : PORT<0>    */
                            /*  | | | |     | +----------- 2 : PIN<2>     */
                            /*  | | | |     | | +--------- 1 : PIN<1>     */
                            /*  | | | |     | | | + ------ 0 : PIN<0>     */
    T3GPPS = 0x11U;         /*  # # # 1  -  0 0 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* タイマ3 ゲート選択：RC1                                              */
    /*====================================================================*/


    /* 一応設定終わったらロックしとく */
    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x01;             /* ロック設定：PPS機能選択を禁止 */
}





/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_timer_setup( void )
{
    func_mset_s_timer0_setup();     /* メインタスク用 タイマ0 */

    func_mset_s_timer1_setup();     /* モータ側ギヤ 回転数取得 ※ゲート機能使用中 */
    func_mset_s_timer3_setup();     /* 1次側ギヤ 回転数取得 ※ゲート機能中 */
    func_mset_s_timer5_setup();     /* ラジコンプロポのパルス幅取得用 */

