aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    func_mset_s_ccp_setup();        /* CCP機能設定 ※PIC18F25Q10ではPWM設定が若干独立しているが、ここで合わせて設定する */
    func_mset_s_timer2_setup();     /* 回転数検出クロック生成用 */
    func_mset_s_timer4_setup();     /* インバータ制御PWM 　※CCP機能へ割り当て中 */
    func_mset_s_timer6_setup();     /* クラッチ用サーボPWM ※CCP機能へ割り当て中 */
}




/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer0_setup( void )
{
    /* タイマ0のクロックソースはPPS設定内で処理 */
    /* Fosc/4 で内部クロック選択した時点で、PPSは影響なし */
    
    /* 10kHzでオーバーフローするよう */

    /* タイマ初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : T0EN       */    /* タイマ0 動作許可 */ 
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : T0OUT      */    /* RO */
                            /*  | | | +------------------- 4 : T016BIT    */    /* 8bit タイマモード */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0OUTPS<3> */    /* 割り込みポストスケーラ */
                            /*  | | | |     | +----------- 2 : T0OUTPS<2> */
                            /*  | | | |     | | +--------- 1 : T0OUTPS<1> */
                            /*  | | | |     | | | + ------ 0 : T0OUTPS<0> */
    T0CON0 = 0x00U;         /*  1 0 0 0  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /*====================================================================*/
                            /*  +------------------------- 7 : T0CS<2>    */    /* 010：Fosc/4 を選択 -> 64/4=16MHz */
                            /*  | +----------------------- 6 : T0CS<1>    */
                            /*  | | +--------------------- 5 : T0CS<0>    */
                            /*  | | | +------------------- 4 : T0ASYNC    */    /* 0:同期を選択 */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0CKPS<3>  */    /* 0111:プリスケーラ：1:512 */
                            /*  | | | |     | +----------- 2 : T0CKPS<2>  */
                            /*  | | | |     | | +--------- 1 : T0CKPS<1>  */
                            /*  | | | |     | | | + ------ 0 : T0CKPS<0>  */
    T0CON1 = 0x49U;         /*  0 1 0 0  -  1 0 0 1                        */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ0 周期設定 ※8bitタイマモードのため、PRレジスタに相当 比較値を設定する */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0H<7>  */
                            /*  | +----------------------- 6 : TMR0H<6>  */
                            /*  | | +--------------------- 5 : TMR0H<5>  */
                            /*  | | | +------------------- 4 : TMR0H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0H<3>  */
                            /*  | | | |     | +----------- 2 : TMR0H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0H<0>  */
    TMR0H = 0x1FU;          /*  0 0 0 1  -  1 0 0 1                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ0 カウンタレジスタ ※8bitタイマモード */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0L<7>  */
                            /*  | +----------------------- 6 : TMR0L<6>  */
                            /*  | | +--------------------- 5 : TMR0L<5>  */
                            /*  | | | +------------------- 4 : TMR0L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0L<3>  */
                            /*  | | | |     | +----------- 2 : TMR0L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0L<0>  */
    TMR0L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ1初期設定                                            */
/*  モータ回転数の取得                                          */
/**************************************************************/
static void func_mset_s_timer1_setup( void )
{
     /* タイマクロック設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : CKPS<1>    */    /* クロック分周 1:1 */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : -          */
                            /*  | | | |     | +----------- 2 : nSYNC      */    /* 外部クロック同期 (使わないのでどっちでもOK) */
                            /*  | | | |     | | +--------- 1 : RD16       */    /* 16bitモード */
                            /*  | | | |     | | | + ------ 0 : ON         */    /* タイマ停止状態 ※初期化完了後、メインタスク開始時にON */
    T1CON = 0x06U;          /*  # # 0 0  -  # 1 1 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ ゲート機能設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : GE         */    /* ゲート機能 有効 */
                            /*  | +----------------------- 6 : GPOL       */    /* ゲート極性 正 */
                            /*  | | +--------------------- 5 : GTM        */    /* ゲートトグルモード １周期測定を実施する */
                            /*  | | | +------------------- 4 : GSPM       */    /* シングルパルスモード無効 連続測定する */ 
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GGO/DONE   */    /* よみだしでしか使わないはず？ */
                            /*  | | | |     | +----------- 2 : GVAL       */    /* ゲート状態 オフだと0になる */
                            /*  | | | |     | | +--------- 1 : -          */
                            /*  | | | |     | | | + ------ 0 : -          */
    T1GCON = 0xE0U;         /*  1 1 1 0  -  0 0 # #                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ クロック選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0101：MFINTOSC = 500kHz */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR1CLK = 0x05U;        /*  # # # #  -  0 1 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/
    
    /* タイマゲート入力信号の選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GSS<3>     */    /* 0000：T1GPPSの設定に依存 PPS設定を参照 */
                            /*  | | | |     | +----------- 2 : GSS<2>     */
                            /*  | | | |     | | +--------- 1 : GSS<1>     */
                            /*  | | | |     | | | + ------ 0 : GSS<0>     */
    TMR1GATE = 0x00U;       /*  # # # #  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

