aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* タイマ カウンタ現在地 クリアする */
    /* タイマ カウンタレジスタ 上位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5H<7>  */
                            /*  | +----------------------- 6 : TMR5H<6>  */
                            /*  | | +--------------------- 5 : TMR5H<5>  */
                            /*  | | | +------------------- 4 : TMR5H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5H<3>  */
                            /*  | | | |     | +----------- 2 : TMR5H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5H<0>  */
    TMR1H = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ カウンタレジスタ 下位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5L<7>  */
                            /*  | +----------------------- 6 : TMR5L<6>  */
                            /*  | | +--------------------- 5 : TMR5L<5>  */
                            /*  | | | +------------------- 4 : TMR5L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5L<3>  */
                            /*  | | | |     | +----------- 2 : TMR5L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5L<0>  */
    TMR1L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  タイマ3初期設定                                            */
/*  1次側ギヤ回転数の取得                                       */
/**************************************************************/
static void func_mset_s_timer3_setup( void )
{
     /* タイマクロック設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : CKPS<1>    */    /* クロック分周 1:1 */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : -          */
                            /*  | | | |     | +----------- 2 : nSYNC      */    /* 外部クロック同期 (使わないのでどっちでもOK) */
                            /*  | | | |     | | +--------- 1 : RD16       */    /* 16bitモード */
                            /*  | | | |     | | | + ------ 0 : ON         */    /* タイマ停止状態 ※初期化完了後、メインタスク開始時にON */
    T3CON = 0x06U;          /*  # # 0 0  -  # 1 1 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ ゲート機能設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : GE         */    /* ゲート機能 有効 */
                            /*  | +----------------------- 6 : GPOL       */    /* ゲート極性 正 */
                            /*  | | +--------------------- 5 : GTM        */    /* ゲートトグルモード １周期測定を実施する */
                            /*  | | | +------------------- 4 : GSPM       */    /* シングルパルスモード無効 連続測定する */ 
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GGO/DONE   */    /* よみだしでしか使わないはず？ */
                            /*  | | | |     | +----------- 2 : GVAL       */    /* ゲート状態 オフだと0になる */
                            /*  | | | |     | | +--------- 1 : -          */
                            /*  | | | |     | | | + ------ 0 : -          */
    T3GCON = 0xE0U;         /*  1 1 1 0  -  0 0 # #                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ クロック選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0101：MFINTOSC = 500kHz */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR3CLK = 0x05U;        /*  # # # #  -  0 1 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/
    
    /* タイマゲート入力信号の選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GSS<3>     */    /* 0000：T1GPPSの設定に依存 PPS設定を参照 */
                            /*  | | | |     | +----------- 2 : GSS<2>     */
                            /*  | | | |     | | +--------- 1 : GSS<1>     */
                            /*  | | | |     | | | + ------ 0 : GSS<0>     */
    TMR3GATE = 0x00U;       /*  # # # #  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

