aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* タイマ カウンタ現在地 クリアする */
    /* タイマ カウンタレジスタ 上位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5H<7>  */
                            /*  | +----------------------- 6 : TMR5H<6>  */
                            /*  | | +--------------------- 5 : TMR5H<5>  */
                            /*  | | | +------------------- 4 : TMR5H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5H<3>  */
                            /*  | | | |     | +----------- 2 : TMR5H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5H<0>  */
    TMR3H = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ カウンタレジスタ 下位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5L<7>  */
                            /*  | +----------------------- 6 : TMR5L<6>  */
                            /*  | | +--------------------- 5 : TMR5L<5>  */
                            /*  | | | +------------------- 4 : TMR5L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5L<3>  */
                            /*  | | | |     | +----------- 2 : TMR5L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5L<0>  */
    TMR3L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ5初期設定                                            */
/*  ラジコンプロポからのパルス幅測定につかう                     */
/*  チャネル数が足りないため、マイコンハードウェア機能は使わず     */
/*  フリーラン動作しているタイマのカウンタを任意で読みだしてキャプチャする */
/*  ラジコンのプロポのPWM波形はON区間が0.5ms~2.5ms程度なので、これを測定できるようにクロック調整 */
/**************************************************************/
static void func_mset_s_timer5_setup( void )
{
    /* タイマクロック設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : CKPS<1>    */    /* クロック分周 1:8 -> 2MHz */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : -          */
                            /*  | | | |     | +----------- 2 : nSYNC      */    /* 外部クロック同期 (使わないのでどっちでもOK) */
                            /*  | | | |     | | +--------- 1 : RD16       */    /* 16bitモード */
                            /*  | | | |     | | | + ------ 0 : ON         */    /* タイマ停止状態 (パルス幅取得処理側でONする) */
    T5CON = 0x36U;          /*  # # 1 1  -  # 1 1 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ ゲート機能設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : GE         */    /* タイマゲート機能使わない：フリーランタイマ */
                            /*  | +----------------------- 6 : GPOL       */
                            /*  | | +--------------------- 5 : GTM        */
                            /*  | | | +------------------- 4 : GSPM       */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GGO/DONE   */
                            /*  | | | |     | +----------- 2 : GVAL       */
                            /*  | | | |     | | +--------- 1 : -          */
                            /*  | | | |     | | | + ------ 0 : -          */
    T5GCON = 0x00U;         /*  0 0 0 0  -  0 0 # #                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ クロック選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0001：HFINTOSC/4 = 16MHz */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR5CLK = 0x01U;        /*  # # # #  -  0 0 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/
    
    /* タイマゲート入力信号の選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0000：T5GPPSの設定に依存　※タイマゲート機能使わないのでなんでもOK */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR5GATE = 0x03U;       /*  # # # #  -  0 0 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ5 カウンタレジスタ 上位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5H<7>  */
                            /*  | +----------------------- 6 : TMR5H<6>  */
                            /*  | | +--------------------- 5 : TMR5H<5>  */
                            /*  | | | +------------------- 4 : TMR5H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5H<3>  */
                            /*  | | | |     | +----------- 2 : TMR5H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5H<0>  */
    TMR5H = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ5 カウンタレジスタ 下位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5L<7>  */
                            /*  | +----------------------- 6 : TMR5L<6>  */
                            /*  | | +--------------------- 5 : TMR5L<5>  */
                            /*  | | | +------------------- 4 : TMR5L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5L<3>  */
                            /*  | | | |     | +----------- 2 : TMR5L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5L<0>  */
    TMR5L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  CCPモジュール設定                                           */
/*  Capture/Compare/PWM 機能設定につかう                        */
/**************************************************************/
static void func_mset_s_ccp_setup( void )
{
    /* CCPモジュール 動作モード選択 */
    /* タイマの附番と連動してないので、確認しずらい・・・ */
    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP4CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP3CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP2CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    CCP1CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* CCPモジュールへのタイマ割り当て設定 */
    /*===================================================================*/
                            /*  +------------------------- 7 : C4TSEL<1> */  /* CCP4:未割当て */
                            /*  | +----------------------- 6 : C4TSEL<0> */
                            /*  | | +--------------------- 5 : C3TSEL<1> */  /* CCP3:Timer6 */
                            /*  | | | +------------------- 4 : C3TSEL<0> */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : C2TSEL<1> */  /* CCP2:Timer4 */
                            /*  | | | |     | +----------- 2 : C2TSEL<0> */
                            /*  | | | |     | | +--------- 1 : C1TSEL<1> */  /* CCP1:Timer2 */
                            /*  | | | |     | | | + ------ 0 : C1TSEL<0> */
    CCPTMRS = 0xE4U;        /*  1 1 1 0  -  0 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 00:Timer2                                                         */
    /* 01:Timer4                                                         */
    /* 10:Timer6                                                         */
    /* 11:未割当                                                          */
    /*===================================================================*/


    /* PWM キャリア周期設定 */
    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* PWM duty比 設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    //CCPR3L = 0x00;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/
    
